Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue Properties
The AnalysisModelIssue type exposes the following members.
Properties
Name | Description
AnalysisObjects
 Gets or sets the analysis objects of the issue
Description
 Gets or sets the description of the issue, translated to the current language
Details
 Gets or sets the details of the issue, translated to the current language
ModelObjects
 Gets or sets the model objects of the issue
Positions
 Gets or sets the positions of the issue
Severity
 Gets or sets the issue severity
Type
 Gets or sets the issue type
Top
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace